fitness_tracker_backend/app/controllers/api/v1/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "age", "gender", "email", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, '2025-02-18 07:37:13.242706', '2025-02-18 07:37:13.242706') RETURNING "id"